package com.daoleen.javalearning.library.util.collection;

/**
 * Created with IntelliJ IDEA.
 * User: daoleen
 * Date: 9/26/13
 * Time: 4:10 PM
 * To change this template use File | Settings | File Templates.
 */

/**
 * PriorityQueue создает очередь с приоритетами на базе компаратора очереди.
 * Если при создании класса никакой компаратор не указан, то применяется стандартный
 * компаратор для того типа данных, который сохраняется в очереди. Стандартный компаратор
 * располагает элементы очереди в порядке возрастания.
 * Предоставляя собственный компаратор, можно задать другую схему сортировки элементов.
 * Например, при сохранении элементом, включающих временную метку, можно внести приоритеты
 * в очередь таким образом, чтобы самые "старые" элементы располагались в начале очереди.
 */
public class PriorityQueueLearning {
}
